/**
 * 1/8(월)
 * * 3-1) 타입스크립트 이해하기
 * https://www.inflearn.com/course/lecture?courseSlug=%ED%95%9C%EC%9E%85-%ED%81%AC%EA%B8%B0-%ED%83%80%EC%9E%85%EC%8A%A4%ED%81%AC%EB%A6%BD%ED%8A%B8&unitId=156629&tab=curriculum
 * =============================================================
 */

// * <<타입스크립트를 이해한다는 것은?>>
// - 어떤 기준으로 타입을 정의하는지
// - 어떤 기준으로 타입간의 관계를 정의하는지
// - 어떤 기준으로 타입의 오류를 검사하는지

// -> 이런 타입스크립트의 구체적인 동작 원리를 낱낱이 파헤쳐보는 것

// ? 타입스크립트 문법만 배워서 바로 쓰면 안되냐?
// 문법이야 물론 바로 배워서 써먹을 수 있음
// 타입스크립트 공식 문법 정리 문서: TypeScript Cheat Sheets

// ! 하지만 타입스크립트의 원리에 대한 이해 없이 타입스크립트를 쓴다는 것은, 어려울 것
